doc/project.tex
% Created 2023-03-14 mar. 15:58
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{proof}
\usepackage{mathpartir}
\usepackage{amsmath,amssymb,amsthm,textcomp}
\usepackage{listofitems}
\usepackage{bssetup}
\usepackage{xparse}
\author{Erik Helmers}
\date{\today}
\title{Bootstrap}
\hypersetup{
 pdfauthor={Erik Helmers},
 pdftitle={Bootstrap},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Minimal calculus}
\label{sec:org8d1a643}
\subsection{Syntax}
\label{sec:org0a97d17}

\begin{decl}{\te, \tty, \tk}
 \drule{\te: \tty                 }{annotated term}
 \drule{\tv                       }{variable}
 \drule{\tlam{x}{\te}             }{lambda}
 \drule{\tapp{\te}{\te[2]}        }{application}
 \drule{\tpi{x}{\tty}{\tty[2]}    }{pi type}
 \drule{\ttup{\te}{\te[2]}        }{tuple}
 \drule{\tfst{\te}                }{fst}
 \drule{\tsnd{\te}                }{snd}
 \drule{\tsig{\tv}{\tty}{\tty[2]} }{sigma type}
 \drule{\tstar                    }{type of types}
\end{decl}


where \(\te\), \(\tty\), \(\tk\) represent general expressions, types and kinds respectively.

\subsection{Context}
\label{sec:org2977552}

\begin{decl}{\ctx}
    \drule{\epsilon}{empty context}
    \drule{\ctx, \tv:\vty}{adding a variable}
\end{decl}

\begin{mathpar}
\inferrule*{  }{ \ctxValid{\epsilon} }
\inferrule*
    { \ctxValid{\ctx} \\ \ctx \ctxmap \tycheck{\vty}{\vstar} }
    { \ctxValid{\ctx, \tv : \vty} }
\end{mathpar}

\subsection{Evaluation}
\label{sec:orga0e0f42}

\begin{decl}{\ve, \vty}
    \drule{\vn                         }{neutral term}
    \drule{\vlam {\vv} {\ve}           }{lambda}
    \drule{\vpi {\tv} {\vty} {\vty[2]} }{dependent function space}
    \drule{\vtup {\ve} {\ve[2]}        }{tuple}
    \drule{\vsig {\tv}{\vty}{\vty[2]}  }{dependent pair space }
    \drule{\vstar                      }{type of types}
\end{decl}

\begin{decl}{\vn}
    \drule{\vv                         }{variable }
    \drule{\napp{\vn}{\ve}             }{neutral app}
    \drule{\nfst{\vn}                  }{neutral first projection}
    \drule{\nsnd{\vn}                  }{neutral second projection}
\end{decl}

\begin{mathpar}


\inferrule*[right=(Star)] {\\} { \evalsto {\tstar}{\vstar} } \and

\inferrule*[right=(Var)]{\\}{ \evalsto {\tv}{\vv} } \and

\inferrule*[right=(Ann)]
  { \evalsto {\te}{\ve} }
  { \evalsto {\te:\tty}{\ve} }
\and

\inferrule*[right=(Lam)]
    { \evalsto {\te}{\ve} }
    { \evalsto {\tlam{\tv}{\te}}{\vlam{x}{\ve}} }
\and
\inferrule*[right=(Tuple)]
    { \evalsto {\te}{\ve} \\
      \evalsto {\te[2]}{\ve[2]} }
    { \ttup{\te}{\te[2]} \evalsto \ttup{\ve}{\ve[2]} }
\and

\inferrule*[right=(App)]
  { \evalsto {\te}{\vlam{\vv}{\ve}} \\
    \evalsto {\tsubst{\ve[1]}{\tv}{\te[2]}}{\ve[2]} }
  { \evalsto {\tapp{\te}{\te[2]}}{\ve[2]} }
\and
\inferrule*[right=(NApp)]
  { \evalsto {\te}{\vn} \\ \evalsto {\te[2]}{\ve[2]} }
  { \evalsto {\tapp{\te}{\te[2]}}{\napp{\vn}{\ve[2]}} }
\and

\inferrule*[right=(Fst)]
  { \evalsto {\te}{\ttup{\ve}{\ve[2]}} }
  { \evalsto {\tfst{\te}}{\ve} }
\and

\inferrule*[right=(Snd)]
  { \evalsto {\te}{\ttup{\ve}{\ve[2]}} }
  { \evalsto {\tsnd{\te}}{\ve[2]}  }
\and

\inferrule*[right=(NFst)]
  { \evalsto {\te}{\vn} }
  { \evalsto {\tfst{\te}}{\nfst{\vn}} }
\and

\inferrule*[right=(NSnd)]
  { \evalsto {\te}{\vn} }
  { \evalsto {\tsnd{\te}}{\nsnd{\vn}} }
\and

\inferrule*[right=(Pi)]
  { \evalsto {\tty}{\vty} \\ \evalsto {\tty[2]}{\vty[2]} }
  { \evalsto {\tpi{\tv}{\tty}{\tty[2]}}{\vpi{\vv}{\vty}{\vty[2]}} }
\and

\inferrule*[right=(Sigma)]
  { \evalsto {\tty}{\vty} \\ \evalsto {\tty[2]}{\vty[2]} }
  { \evalsto {\tsig{\tv}{\tty}{\tty[2]}}{\vsig{\vv}{\vty}{\vty[2]}} }
\and


\end{mathpar}

\subsection{Typing}
\label{sec:org309fa84}

In the following, \(\tysynth {\te}{\vty}\) is an expression whose type synthezises to \(\vty\) while \(\tycheck{e}{\vty}\) is checkable.

\begin{mathpar}
\centering

\inferrule*[right=(Chk)]
  { \ctx \ctxmap \tysynth {\te}{\vty} }
  { \ctx \ctxmap \tycheck{\te}{\vty} }
\and

\inferrule*[right=(Ann)]
  { \ctx \ctxmap \tycheck{\tty}{\vstar} \\ \evalsto {\tty}{\vty} \\
   \ctx \ctxmap \tycheck{\te}{\vty}}
  { \ctx \ctxmap \tysynth {(\te:\tty)}{\vty} }
\and


\inferrule*[right=(Star)]
  { }
  { \ctx \ctxmap \tycheck{\tstar}{\vstar} }
\and


\inferrule*[right=(Var)]
   { \ctx(\tv) = \vty }
   { \ctx \ctxmap \tysynth {\tv}{\vty} }
\and

\inferrule*[right=(Lam)]
  { \ctx,\tv : \vty \ctxmap \tycheck{\te}{\vty[2]} }
  { \ctx \ctxmap \tycheck{\vlam{\tv}{\te}}{\vpi{\tv}{\vty}{\vty[2]}} }
\and

\inferrule*[right=(Tuple)]
  { \ctx \ctxmap \tycheck{\te}{\vty} \\  \ctx \ctxmap \tycheck{\te[2]}{\vty[2]}}
  { \ctx \ctxmap \tycheck {\vtup{\te}{\te[2]}}{\vsig{\tv}{\vty}{\vty[2]}}}
\and

\inferrule*[right=(App)]
  { \ctx \ctxmap \tysynth {\te}{\vpi{x}{\vty}{\vty[2]}}  \\  \ctx \ctxmap \tycheck {\te[2]}{\vty} \\ \evalsto {\tsubst{\vty[2]}{\tv}{\te[2]}}{\vty[3]} }
  { \ctx \ctxmap \tysynth {\tapp{\te}{\te[2]}}{\vty[3]} }
\and

\inferrule*[right=(Fst)]
  { \ctx \ctxmap \tysynth {\te}{\vsig{x}{\vty}{\vty[2]}} }
  { \ctx \ctxmap \tysynth {\tfst{\te}}{\vty} }
\and

\inferrule*[right=(Snd)]
  { \ctx \ctxmap \tysynth {\te}{\vsig{x}{\vty}{\vty[2]}} \\
    \evalsto {\tsubst{\vty[2]}{\tv}{\tfst{e}}}{\vty[3]} }
  { \ctx \ctxmap \tysynth {\tsnd{\te}}{\vty[3]} }
\and


\inferrule*[right=(Pi)]
   { \ctx \ctxmap \tycheck {\tty}{\vstar} \\ \evalsto {\tty}{\vty} \\ \ctx,\tv:\vty \ctxmap \tycheck {\tty[2]}{\vstar} }
   { \ctx \ctxmap \tycheck {\tpi{\tv}{\tty}{\tty[2]}}{\vstar} }
\and

\inferrule*[right=(Sigma)]
   { \ctx \ctxmap \tycheck {\tty}{\vstar} \\ \evalsto {\tty}{\vty} \\ \ctx,\tv:\vty \ctxmap \tycheck {\tty[2]}{\vstar} }
   { \ctx \ctxmap \tycheck {\tsig{\tv}{\tty}{\tty[2]}}{\vstar} }
\and
\end{mathpar}


\begin{mathpar}
\and

\and
\end{mathpar}
\end{document}